1.header(헤더태그)
**말그대로 헤더영역을 표시하는 태그**

2. nev (네비게이션 태그)
**하이퍼텍스트랑 연결된것**

3. main (핵심 콘덴츠를 담는 태그)

4. artcle (독립적인 콘덴츠를 담는 태그)

5. section (콘덴츠의 영역)

6. aside (사이드 바를 나타냄)

7. footer (푸터 영역을 나타냄(꼬리?))

8. div (여러 소스를 묶는 태그)


<h?> => ?는 숫자가 들어감
1~6까지 있 숫자가 작아질수록 글자가 커지고 진해짐

<p> => 텍스트의 단락을 만드는 태그

<br> => 줄바꿈 </br> = 필요 X

<blockquote> => 인용문 들여쓰기 가능 (대충 탭 범위)

강조 -> 굵게하기
<strong> <b> => 이 두개는 눈으로 보면 차이점이 없음 (보통 b를 많이 씀)
두개를 나눠 쓰는 이유 -> "가독성"

가독성 => 프로그래밍에서 가독성이란 바로 해석 능력?
경고나 주의 같은 중요한 내용은 <strong>  태그
<b>로 가독성 체크

<em> <i> => 기울임
식명칭 이탤릭체(기울임)
보통여기 <em>을 많이 쓰임
[em]은 보통 체를 기울고싶을떄 [i]는 해당문구가 관용적인 표현을 쓰일떄
보통은 기울임은 em 태그를 쓴다.

<s> -> 취소선
<sub> -> 아래첨자
<sup> -> 윗첨자
<code> -> 프로그래밍 코드를 텍스트로 인식하는것!

목록
<ol 옵션> 
    <li>항목 1<li>
    <li>항목 2<li>
</ol>
옵션 생략 -> 자동으로 숫자

type = "?"
1 = 숫자(디폴트)
a = 영어(소문자)
A = 영어(대문자)
i = 로마자 소
I = 로마자 대

start = "?" [숫자만 사용]
ex) <ol type ="a" stret = "3">
// 시작할때 a b c [C 부터 시작]

<ol>은 순서를 지정
<ul>은 순서 지정 X

<dl> <dt> <dd> -> 디렉토리 구조 복종속성?

표만들기
표만들기 -> 글자의 배치

가 나 다 --- 3칸짜리표

가 나
다 라 << 2다시 2칸 표

표는 행, 열, 셀
엑셀로 보면
열 = A, B, C
행 = 1, 2, 3
셀 = 각각의 칸 -> 셀

<table>   -> 표를 만드는 태그
<caption> -> 표의 제목을 다는 태그
<tr> -> 행을 만듬
<td> -> 열을 만듬

<img> 태그를 활용한다 단일태그/ 사용한 마무리 문구가 없다는게 특징 
<img src = "이미지 경로" alt = "대체텏스트">
이미지결로 -> 파일의 위친데
단 웹문서와 같은 위치에 그림파일이 존재할때는 앞선 경로는 생략가능


대체 텍스트 -> 인터넷환경에 따라 이미지를 로드할 수 없는 경우가 생길떄 나오는 문구

나나쿠사 나즈나 사진을 올렸을때 여기엔 대체 택스트로 "나나쿠사 나즈나 사진 " 단 alt는 생략가능

웹사이트에서 불러올수있는 표준 이미지 압축파일 3종류
(jpg(jpeg),png,gif)

사진의 크기를 지정하는 태그
<width>  => 가로크기
<height> => 세로크기

참고 => 크기조절할떄 width 옵션 하나만 쓰면 가로새로가 자동으로 맞춰서 지정

오디오나 비디오도 삽입할수있음
<object> 명령어 오디오나 비디오 여러가지
한글파일 hwp나 pdf 같은것 삽입할수있다.

기본은 <object 크기(width height) date="파일경로"></object>
보통문서는 pdf(hwp이런것들 가능한데 보안에 문제생겨서 경고창뜸)
비디오 => mp4 webm
오디오 =>mp3

옵션값
date -> 문서
audio -> 오디어 파일 audio ="경로"
video -> 비디오 파일 넣는 옵션
    -> controls -> 컨트롤바를 만든다.
    -> loop -> 반복재생

하이퍼텍스트 링크삽입
<a>태그

사용법 
<a href ="링크할주소">텍스트 및 이미지
























